; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))

  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (and (calibrated ?i)))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (and (have_image ?d ?m))))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	satellite4 - satellite
	instrument8 - instrument
	thermograph2 - mode
	image1 - mode
	spectrograph3 - mode
	image0 - mode
	GroundStation1 - direction
	GroundStation0 - direction
	GroundStation4 - direction
	Star2 - direction
	GroundStation3 - direction
	Planet5 - direction
	Phenomenon6 - direction
	Star7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Planet12 - direction
	Planet13 - direction
	Planet14 - direction
	Planet15 - direction
	Star16 - direction
	Planet17 - direction
	Planet18 - direction
	Planet19 - direction
	Planet20 - direction
	Planet21 - direction
	Planet22 - direction
	Phenomenon23 - direction
	Phenomenon24 - direction
	Star25 - direction
	Star26 - direction
)
(:init
	(supports instrument0 image0)
	(supports instrument0 thermograph2)
	(calibration_target instrument0 Star2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon6)
	(supports instrument1 thermograph2)
	(calibration_target instrument1 GroundStation3)
	(supports instrument2 thermograph2)
	(supports instrument2 image0)
	(calibration_target instrument2 Star2)
	(supports instrument3 thermograph2)
	(supports instrument3 image1)
	(supports instrument3 spectrograph3)
	(calibration_target instrument3 GroundStation0)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star25)
	(supports instrument4 thermograph2)
	(supports instrument4 spectrograph3)
	(calibration_target instrument4 GroundStation0)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star7)
	(supports instrument5 image1)
	(supports instrument5 spectrograph3)
	(supports instrument5 image0)
	(calibration_target instrument5 GroundStation4)
	(supports instrument6 image0)
	(supports instrument6 image1)
	(calibration_target instrument6 GroundStation4)
	(supports instrument7 spectrograph3)
	(supports instrument7 image1)
	(calibration_target instrument7 Star2)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star16)
	(supports instrument8 image0)
	(calibration_target instrument8 GroundStation3)
	(on_board instrument8 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star26)
)
(:goal (and
	(pointing satellite0 Phenomenon10)
	(pointing satellite4 Planet22)
	(have_image Planet5 image1)
	(have_image Phenomenon6 image1)
	(have_image Star7 image0)
	(have_image Planet8 spectrograph3)
	(have_image Phenomenon9 image0)
	(have_image Planet11 spectrograph3)
	(have_image Planet12 image0)
	(have_image Planet13 image1)
	(have_image Planet14 image1)
	(have_image Planet15 thermograph2)
	(have_image Star16 image0)
	(have_image Planet17 image1)
	(have_image Planet18 spectrograph3)
	(have_image Planet19 spectrograph3)
	(have_image Planet20 thermograph2)
	(have_image Planet21 spectrograph3)
	(have_image Planet22 image0)
	(have_image Phenomenon23 thermograph2)
	(have_image Phenomenon24 image1)
	(have_image Star26 image0)
))

)

; plan
1. (switch_on instrument8 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument8)
   goals met: 0 of 22
2. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 22
3. (turn_to satellite4 groundstation3 star26)
   deleted: (pointing satellite4 star26)
   added: (pointing satellite4 groundstation3)
   goals met: 0 of 22
4. (calibrate satellite4 instrument8 groundstation3)
   added: (calibrated instrument8)
   goals met: 0 of 22
5. (turn_to satellite4 phenomenon9 groundstation3)
   deleted: (pointing satellite4 groundstation3)
   added: (pointing satellite4 phenomenon9)
   goals met: 0 of 22
6. (take_image satellite4 phenomenon9 instrument8 image0)
   added: (have_image phenomenon9 image0)
   goals met: 1 of 22
7. (turn_to satellite4 planet12 phenomenon9)
   deleted: (pointing satellite4 phenomenon9)
   added: (pointing satellite4 planet12)
   goals met: 1 of 22
8. (take_image satellite4 planet12 instrument8 image0)
   added: (have_image planet12 image0)
   goals met: 2 of 22
9. (turn_to satellite4 planet22 planet12)
   deleted: (pointing satellite4 planet12)
   added: (pointing satellite4 planet22)
   goals met: 3 of 22
10. (take_image satellite4 planet22 instrument8 image0)
   added: (have_image planet22 image0)
   goals met: 4 of 22
11. (turn_to satellite1 groundstation0 star25)
   deleted: (pointing satellite1 star25)
   added: (pointing satellite1 groundstation0)
   goals met: 4 of 22
12. (calibrate satellite1 instrument3 groundstation0)
   added: (calibrated instrument3)
   goals met: 4 of 22
13. (turn_to satellite1 phenomenon23 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 phenomenon23)
   goals met: 4 of 22
14. (take_image satellite1 phenomenon23 instrument3 thermograph2)
   added: (have_image phenomenon23 thermograph2)
   goals met: 5 of 22
15. (turn_to satellite1 phenomenon24 phenomenon23)
   deleted: (pointing satellite1 phenomenon23)
   added: (pointing satellite1 phenomenon24)
   goals met: 5 of 22
16. (take_image satellite1 phenomenon24 instrument3 image1)
   added: (have_image phenomenon24 image1)
   goals met: 6 of 22
17. (turn_to satellite1 phenomenon6 phenomenon24)
   deleted: (pointing satellite1 phenomenon24)
   added: (pointing satellite1 phenomenon6)
   goals met: 6 of 22
18. (take_image satellite1 phenomenon6 instrument3 image1)
   added: (have_image phenomenon6 image1)
   goals met: 7 of 22
19. (turn_to satellite1 planet11 phenomenon6)
   deleted: (pointing satellite1 phenomenon6)
   added: (pointing satellite1 planet11)
   goals met: 7 of 22
20. (take_image satellite1 planet11 instrument3 spectrograph3)
   added: (have_image planet11 spectrograph3)
   goals met: 8 of 22
21. (turn_to satellite1 planet13 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 planet13)
   goals met: 8 of 22
22. (take_image satellite1 planet13 instrument3 image1)
   added: (have_image planet13 image1)
   goals met: 9 of 22
23. (turn_to satellite1 planet14 planet13)
   deleted: (pointing satellite1 planet13)
   added: (pointing satellite1 planet14)
   goals met: 9 of 22
24. (take_image satellite1 planet14 instrument3 image1)
   added: (have_image planet14 image1)
   goals met: 10 of 22
25. (turn_to satellite1 planet15 planet14)
   deleted: (pointing satellite1 planet14)
   added: (pointing satellite1 planet15)
   goals met: 10 of 22
26. (take_image satellite1 planet15 instrument3 thermograph2)
   added: (have_image planet15 thermograph2)
   goals met: 11 of 22
27. (turn_to satellite1 planet17 planet15)
   deleted: (pointing satellite1 planet15)
   added: (pointing satellite1 planet17)
   goals met: 11 of 22
28. (take_image satellite1 planet17 instrument3 image1)
   added: (have_image planet17 image1)
   goals met: 12 of 22
29. (turn_to satellite1 planet18 planet17)
   deleted: (pointing satellite1 planet17)
   added: (pointing satellite1 planet18)
   goals met: 12 of 22
30. (take_image satellite1 planet18 instrument3 spectrograph3)
   added: (have_image planet18 spectrograph3)
   goals met: 13 of 22
31. (turn_to satellite1 planet19 planet18)
   deleted: (pointing satellite1 planet18)
   added: (pointing satellite1 planet19)
   goals met: 13 of 22
32. (take_image satellite1 planet19 instrument3 spectrograph3)
   added: (have_image planet19 spectrograph3)
   goals met: 14 of 22
33. (turn_to satellite1 planet20 planet19)
   deleted: (pointing satellite1 planet19)
   added: (pointing satellite1 planet20)
   goals met: 14 of 22
34. (take_image satellite1 planet20 instrument3 thermograph2)
   added: (have_image planet20 thermograph2)
   goals met: 15 of 22
35. (turn_to satellite1 planet21 planet20)
   deleted: (pointing satellite1 planet20)
   added: (pointing satellite1 planet21)
   goals met: 15 of 22
36. (take_image satellite1 planet21 instrument3 spectrograph3)
   added: (have_image planet21 spectrograph3)
   goals met: 16 of 22
37. (turn_to satellite1 planet5 planet21)
   deleted: (pointing satellite1 planet21)
   added: (pointing satellite1 planet5)
   goals met: 16 of 22
38. (take_image satellite1 planet5 instrument3 image1)
   added: (have_image planet5 image1)
   goals met: 17 of 22
39. (turn_to satellite1 planet8 planet5)
   deleted: (pointing satellite1 planet5)
   added: (pointing satellite1 planet8)
   goals met: 17 of 22
40. (take_image satellite1 planet8 instrument3 spectrograph3)
   added: (have_image planet8 spectrograph3)
   goals met: 18 of 22
41. (turn_to satellite0 phenomenon10 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 phenomenon10)
   goals met: 19 of 22
42. (turn_to satellite4 star16 planet22)
   deleted: (pointing satellite4 planet22)
   added: (pointing satellite4 star16)
   goals met: 18 of 22
43. (take_image satellite4 star16 instrument8 image0)
   added: (have_image star16 image0)
   goals met: 19 of 22
44. (turn_to satellite4 planet22 star16)
   deleted: (pointing satellite4 star16)
   added: (pointing satellite4 planet22)
   goals met: 20 of 22
45. (turn_to satellite4 star26 planet22)
   deleted: (pointing satellite4 planet22)
   added: (pointing satellite4 star26)
   goals met: 19 of 22
46. (take_image satellite4 star26 instrument8 image0)
   added: (have_image star26 image0)
   goals met: 20 of 22
47. (turn_to satellite4 planet22 star26)
   deleted: (pointing satellite4 star26)
   added: (pointing satellite4 planet22)
   goals met: 21 of 22
48. (turn_to satellite4 star7 planet22)
   deleted: (pointing satellite4 planet22)
   added: (pointing satellite4 star7)
   goals met: 20 of 22
49. (take_image satellite4 star7 instrument8 image0)
   added: (have_image star7 image0)
   goals met: 21 of 22
50. (turn_to satellite4 planet22 star7)
   deleted: (pointing satellite4 star7)
   added: (pointing satellite4 planet22)
   goals met: 22 of 22
